Performance_Testing_Test_Plan.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.5">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Performance_Testing_Test_Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <kg.apc.jmeter.threads.UltimateThreadGroup guiclass="kg.apc.jmeter.threads.UltimateThreadGroupGui" testclass="kg.apc.jmeter.threads.UltimateThreadGroup" testname="Load testing expected 10 VU" enabled="true">
        <collectionProp name="ultimatethreadgroupdata">
          <collectionProp name="-2140057802">
            <stringProp name="50">2</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="50">2</stringProp>
            <stringProp name="1722">60</stringProp>
            <stringProp name="1567">10</stringProp>
          </collectionProp>
          <collectionProp name="943375382">
            <stringProp name="52">4</stringProp>
            <stringProp name="1724">62</stringProp>
            <stringProp name="1567">10</stringProp>
            <stringProp name="1722">60</stringProp>
            <stringProp name="1598">20</stringProp>
          </collectionProp>
          <collectionProp name="-854542750">
            <stringProp name="54">6</stringProp>
            <stringProp name="48720">132</stringProp>
            <stringProp name="1598">20</stringProp>
            <stringProp name="1722">60</stringProp>
            <stringProp name="1629">30</stringProp>
          </collectionProp>
          <collectionProp name="445964001">
            <stringProp name="56">8</stringProp>
            <stringProp name="49619">212</stringProp>
            <stringProp name="1629">30</stringProp>
            <stringProp name="48687">120</stringProp>
            <stringProp name="1660">40</stringProp>
          </collectionProp>
          <collectionProp name="259221382">
            <stringProp name="1567">10</stringProp>
            <stringProp name="50735">362</stringProp>
            <stringProp name="1660">40</stringProp>
            <stringProp name="49586">200</stringProp>
            <stringProp name="1691">50</stringProp>
          </collectionProp>
          <collectionProp name="-888733021">
            <stringProp name="56">8</stringProp>
            <stringProp name="53432">602</stringProp>
            <stringProp name="1691">50</stringProp>
            <stringProp name="48687">120</stringProp>
            <stringProp name="1660">40</stringProp>
          </collectionProp>
        </collectionProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="TestPlan.comments">rampup time of second rec(startuptime)=shut down of first record, initial=initial+startup+hold load</stringProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
      </kg.apc.jmeter.threads.UltimateThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">www.udemy.com</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>
      <kg.apc.jmeter.threads.UltimateThreadGroup guiclass="kg.apc.jmeter.threads.UltimateThreadGroupGui" testclass="kg.apc.jmeter.threads.UltimateThreadGroup" testname="Stress testing with 150 VU" enabled="false">
        <collectionProp name="ultimatethreadgroupdata">
          <collectionProp name="1413389862">
            <stringProp name="1603">25</stringProp>
            <stringProp name="0">0</stringProp>
            <stringProp name="1603">25</stringProp>
            <stringProp name="50547">300</stringProp>
            <stringProp name="1691">50</stringProp>
          </collectionProp>
          <collectionProp name="1447162043">
            <stringProp name="1691">50</stringProp>
            <stringProp name="50614">325</stringProp>
            <stringProp name="1691">50</stringProp>
            <stringProp name="50547">300</stringProp>
            <stringProp name="1758">75</stringProp>
          </collectionProp>
          <collectionProp name="2052275607">
            <stringProp name="1758">75</stringProp>
            <stringProp name="53652">675</stringProp>
            <stringProp name="1758">75</stringProp>
            <stringProp name="50547">300</stringProp>
            <stringProp name="48625">100</stringProp>
          </collectionProp>
          <collectionProp name="-1828612350">
            <stringProp name="48625">100</stringProp>
            <stringProp name="1507578">1050</stringProp>
            <stringProp name="48625">100</stringProp>
            <stringProp name="1515111">1800</stringProp>
            <stringProp name="1758">75</stringProp>
          </collectionProp>
          <collectionProp name="161261078">
            <stringProp name="48692">125</stringProp>
            <stringProp name="1542267">2580</stringProp>
            <stringProp name="1758">75</stringProp>
            <stringProp name="1543941">2700</stringProp>
            <stringProp name="1691">50</stringProp>
          </collectionProp>
          <collectionProp name="-1495252956">
            <stringProp name="48780">150</stringProp>
            <stringProp name="1629630">5355</stringProp>
            <stringProp name="1691">50</stringProp>
            <stringProp name="1572771">3600</stringProp>
            <stringProp name="1758">75</stringProp>
          </collectionProp>
        </collectionProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
      </kg.apc.jmeter.threads.UltimateThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">www.banglapuzzle.com</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>
      <kg.apc.jmeter.threads.UltimateThreadGroup guiclass="kg.apc.jmeter.threads.UltimateThreadGroupGui" testclass="kg.apc.jmeter.threads.UltimateThreadGroup" testname="Spike testing expected 120 VU and 140 VU" enabled="false">
        <collectionProp name="ultimatethreadgroupdata">
          <collectionProp name="-1095940285">
            <stringProp name="1603">25</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="1603">25</stringProp>
            <stringProp name="50547">300</stringProp>
            <stringProp name="1598">20</stringProp>
          </collectionProp>
          <collectionProp name="1391192468">
            <stringProp name="1691">50</stringProp>
            <stringProp name="50614">325</stringProp>
            <stringProp name="1691">50</stringProp>
            <stringProp name="50547">300</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="305718610">
            <stringProp name="48687">120</stringProp>
            <stringProp name="53652">675</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="1691">50</stringProp>
            <stringProp name="1603">25</stringProp>
          </collectionProp>
          <collectionProp name="2019834125">
            <stringProp name="1691">50</stringProp>
            <stringProp name="54458">725</stringProp>
            <stringProp name="1603">25</stringProp>
            <stringProp name="50547">300</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="-2049702800">
            <stringProp name="48749">140</stringProp>
            <stringProp name="1507578">1050</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="60">60</stringProp>
            <stringProp name="1691">50</stringProp>
          </collectionProp>
          <collectionProp name="-646819860">
            <stringProp name="1691">50</stringProp>
            <stringProp name="1508415">1110</stringProp>
            <stringProp name="1691">50</stringProp>
            <stringProp name="50547">300</stringProp>
            <stringProp name="1603">25</stringProp>
          </collectionProp>
        </collectionProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
      </kg.apc.jmeter.threads.UltimateThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">www.banglapuzzle.com</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>
      <kg.apc.jmeter.threads.UltimateThreadGroup guiclass="kg.apc.jmeter.threads.UltimateThreadGroupGui" testclass="kg.apc.jmeter.threads.UltimateThreadGroup" testname="Endurance testing: peak load of 80 VU for 3 hours" enabled="false">
        <collectionProp name="ultimatethreadgroupdata">
          <collectionProp name="-273749195">
            <stringProp name="1598">20</stringProp>
            <stringProp name="0">0</stringProp>
            <stringProp name="1598">20</stringProp>
            <stringProp name="50547">300</stringProp>
            <stringProp name="1660">40</stringProp>
          </collectionProp>
          <collectionProp name="-1825653192">
            <stringProp name="1660">40</stringProp>
            <stringProp name="50609">320</stringProp>
            <stringProp name="1660">40</stringProp>
            <stringProp name="50547">300</stringProp>
            <stringProp name="1758">75</stringProp>
          </collectionProp>
          <collectionProp name="-1497173088">
            <stringProp name="1722">60</stringProp>
            <stringProp name="53616">660</stringProp>
            <stringProp name="1758">75</stringProp>
            <stringProp name="50547">300</stringProp>
            <stringProp name="48625">100</stringProp>
          </collectionProp>
          <collectionProp name="-1379939743">
            <stringProp name="1784">80</stringProp>
            <stringProp name="1507521">1035</stringProp>
            <stringProp name="48625">100</stringProp>
            <stringProp name="46737849">10800</stringProp>
            <stringProp name="1722">60</stringProp>
          </collectionProp>
          <collectionProp name="-910697718">
            <stringProp name="1722">60</stringProp>
            <stringProp name="46768699">11935</stringProp>
            <stringProp name="1722">60</stringProp>
            <stringProp name="50547">300</stringProp>
            <stringProp name="1691">50</stringProp>
          </collectionProp>
          <collectionProp name="2049279856">
            <stringProp name="1660">40</stringProp>
            <stringProp name="46791949">12295</stringProp>
            <stringProp name="1691">50</stringProp>
            <stringProp name="50547">300</stringProp>
            <stringProp name="1603">25</stringProp>
          </collectionProp>
        </collectionProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
      </kg.apc.jmeter.threads.UltimateThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">www.banglapuzzle.com</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">C:\Users\Admin\Desktop\JMeter_Project\loadtesting.csv</stringProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="Graph Results" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="SimpleDataWriter" testclass="ResultCollector" testname="Simple Data Writer" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">C:\Users\Admin\Desktop\JMeter_Project\Load_Testing.csv</stringProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>